Looks like problem is with engine_mode setting which for some reason is set to `provisioned` and I deploy version `perallelquery`.

```
  # module.rds-aurora.module.rds-aurora.aws_rds_cluster.this must be replaced
-/+ resource "aws_rds_cluster" "this" {
        apply_immediately                   = false
      ~ arn                                 = "arn:aws:rds:::cluster:aurora_cluster" -> (known after apply)
      ~ availability_zones                  = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
        backtrack_window                    = 0
        backup_retention_period             = 7
        cluster_identifier                  = "aurora_cluster"
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [
          - "instance1",
          - "instance2",
        ] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-" -> (known after apply)
        copy_tags_to_snapshot               = false
      + database_name                       = (known after apply)
        db_cluster_parameter_group_name     = "instancecluster"
        db_subnet_group_name                = "aurora_cluster"
        deletion_protection                 = false
        enable_http_endpoint                = false
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "aurora_cluster.rds.amazonaws.com" -> (known after apply)
        engine                              = "aurora"
      ~ engine_mode                         = "provisioned" -> "parallelquery" # forces replacement
        engine_version                      = "5.6.mysql_aurora.1.23.0"
        final_snapshot_identifier           = "final-instance"
      ~ hosted_zone_id                      = "" -> (known after apply)
        iam_database_authentication_enabled = false
      - iam_roles                           = [] -> null
      ~ id                                  = "aurora_cluster" -> (known after apply)
        kms_key_id                          = ""
        master_password                     = (sensitive value)
        master_username                     = ""
        port                                = 3306
        preferred_backup_window             = "08:00-09:00"
        preferred_maintenance_window        = "sat:10:00-sat:11:00"
      ~ reader_endpoint                     = "aurora_cluster.rds.amazonaws.com" -> (known after apply)
        skip_final_snapshot                 = false
        storage_encrypted                   = true
        tags                                = {
            "Environment" = "prod"
            "Name"        = "aurora_cluster"
            "Terraform"   = "true"
        }
        vpc_security_group_ids              = [
            "sg-",
        ]
    }
```
According to documentation this value defaults to `provisioned` which is what I see here too but cluster is provisioned as `parallelquery`.

Looks like instance count have nothing to do with this and trying to run code with that setting even without any changes tries to replace entire cluster.

```
terraform version
Terraform v0.12.28
+ provider.aws v3.9.0
+ provider.random v2.3.0
```

